KianWeng/rt-thread/bsp/frdm-kl26z/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART0 Receive Data Source Select: UART_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART0 Transmit Data Source Select: UART0_TX pin */
#define SOPT5_UART1RXSRC_UART_RX 0x00u /*!<@brief UART1 Receive Data Source Select: UART1_RX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART1 Transmit Data Source Select: UART1_TX pin */

/*! @name PORTC3 (number 46), LED1_R
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED1_R_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED1_R_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED1_R_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED1_R_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LED1_R_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LED1_R_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC4 (number 49), LED1_G
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED1_G_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED1_G_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED1_G_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED1_G_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LED1_G_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LED1_G_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC5 (number 50), LED1_B
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED1_B_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED1_B_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED1_B_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED1_B_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LED1_B_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LED1_B_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC0 (number 43), LED2_G
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED2_G_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED2_G_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED2_G_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED2_G_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LED2_G_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LED2_G_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC2 (number 45), LED2_B
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED2_B_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED2_B_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED2_B_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED2_B_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LED2_B_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LED2_B_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB19 (number 42), LED2_R
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED2_R_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED2_R_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED2_R_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED2_R_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED2_R_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_LED2_R_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB16 (number 39), LED3_R
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED3_R_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED3_R_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED3_R_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED3_R_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED3_R_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_LED3_R_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB17 (number 40), LED3_G
  @{ */

