KianWeng/rt-thread/bsp/frdm-kl26z/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_LED3_G_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED3_G_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED3_G_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED3_G_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED3_G_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_LED3_G_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB18 (number 41), LED3_B
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED3_B_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED3_B_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED3_B_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED3_B_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED3_B_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_LED3_B_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB3 (number 38), LCD_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LCD_RST_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LCD_RST_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LCD_RST_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_RST_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_RST_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD_RST_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB2 (number 37), LCD_DC
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LCD_DC_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LCD_DC_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LCD_DC_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_DC_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_DC_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD_DC_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC6 (number 51), SW1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW1_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW1_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_SW1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC7 (number 52), SW2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW2_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW2_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW2_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_SW2_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC8 (number 53), SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW3_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW3_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW3_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW3_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW3_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_SW3_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC9 (number 54), SW4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW4_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW4_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW4_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW4_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW4_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_SW4_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTA5 (number 27), SW5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW5_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW5_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW5_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW5_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW5_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_SW5_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTA12 (number 28), SW6
  @{ */

