KianWeng/rt-thread/bsp/frdm-kl26z/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_SW6_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW6_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW6_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW6_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_SW6_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_SW6_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTA13 (number 29), SW7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW7_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW7_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW7_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW7_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_SW7_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_SW7_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTA19 (number 33), SW8
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW8_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW8_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW8_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW8_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_SW8_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_SW8_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE20 (number 9), AD5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_AD5_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_AD5_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_AD5_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_AD5_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_AD5_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_AD5_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE22 (number 11), AD3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_AD3_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_AD3_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_AD3_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_AD3_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_AD3_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_AD3_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE23 (number 12), AD2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_AD2_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_AD2_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_AD2_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_AD2_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_AD2_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_AD2_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE29 (number 17), AD1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_AD1_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_AD1_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_AD1_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_AD1_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_AD1_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_AD1_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE30 (number 18), AD0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_AD0_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_AD0_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_AD0_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_AD0_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_AD0_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_AD0_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE31 (number 19), IO12
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_IO12_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO12_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO12_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO12_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_IO12_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_IO12_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTE24 (number 20), IO10
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_IO10_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO10_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO10_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO10_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_IO10_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_IO10_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTE25 (number 21), IO11
  @{ */

