KianWeng/rt-thread/bsp/frdm-kl26z/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_IO11_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO11_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO11_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO11_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_IO11_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_IO11_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTD0 (number 57), IO7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_IO7_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO7_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO7_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO7_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_IO7_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_IO7_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD1 (number 58), IO6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_IO6_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO6_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO6_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO6_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_IO6_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_IO6_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD2 (number 59), IO5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_IO5_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO5_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO5_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO5_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_IO5_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_IO5_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD3 (number 60), IO4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_IO4_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO4_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO4_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO4_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_IO4_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_IO4_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD4 (number 61), IO3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_IO3_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO3_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO3_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_IO3_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_IO3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD5 (number 62), IO2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_IO2_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO2_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_IO2_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_IO2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD6 (number 63), IO1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_IO1_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO1_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_IO1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_IO1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD7 (number 64), IO0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_IO0_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO0_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO0_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO0_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_IO0_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_IO0_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC10 (number 55), IO8
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_IO8_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO8_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO8_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO8_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_IO8_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_IO8_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTC11 (number 56), IO9
  @{ */

