KianWeng/rt-thread/bsp/frdm-kl26z/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_IO9_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_IO9_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_IO9_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_IO9_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_IO9_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_IO9_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE21 (number 10), AD4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_AD4_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_AD4_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_AD4_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_AD4_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_AD4_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_AD4_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB0 (number 35), LCD_D1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LCD_D1_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LCD_D1_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LCD_D1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_D1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_D1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LCD_D1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB1 (number 36), LCD_D0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LCD_D0_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LCD_D0_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LCD_D0_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_D0_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_D0_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_LCD_D0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
